## NaN
* Not a Number

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.NaN

nan

In [3]:
type(np.NaN)

float

In [4]:
n = np.NaN
m = 1
m + n

nan

# NaN in Series

In [5]:
s1 = pd.Series([1,2,np.NaN,3],index=list('ABCD'))
s1

A    1.0
B    2.0
C    NaN
D    3.0
dtype: float64

In [6]:
s1.isnull()

A    False
B    False
C     True
D    False
dtype: bool

In [7]:
s1.notnull()

A     True
B     True
C    False
D     True
dtype: bool

In [8]:
s1.fillna(2)

A    1.0
B    2.0
C    2.0
D    3.0
dtype: float64

In [9]:
s1.dropna()

A    1.0
B    2.0
D    3.0
dtype: float64

# NaN in DataFrame

In [10]:
df1 = pd.DataFrame([[1,2,3,np.NaN],[np.NaN,5,np.NaN,6],[6,np.NaN,np.NaN,np.NaN],[np.NaN,np.NaN,np.NaN,np.NaN]],index=list('ABCD'))
df1

     0    1    2    3
A  1.0  2.0  3.0  NaN
B  NaN  5.0  NaN  6.0
C  6.0  NaN  NaN  NaN
D  NaN  NaN  NaN  NaN

In [11]:
df1.isnull()

       0      1      2      3
A  False  False  False   True
B   True  False   True  False
C  False   True   True   True
D   True   True   True   True

In [12]:
df1.notnull()

       0      1      2      3
A   True   True   True  False
B  False   True  False   True
C   True  False  False  False
D  False  False  False  False

In [13]:
df1.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [14]:
df1.dropna(how='all')

     0    1    2    3
A  1.0  2.0  3.0  NaN
B  NaN  5.0  NaN  6.0
C  6.0  NaN  NaN  NaN

In [15]:
df1.dropna(thresh=2)

     0    1    2    3
A  1.0  2.0  3.0  NaN
B  NaN  5.0  NaN  6.0

In [16]:
df1.fillna(0)

     0    1    2    3
A  1.0  2.0  3.0  0.0
B  0.0  5.0  0.0  6.0
C  6.0  0.0  0.0  0.0
D  0.0  0.0  0.0  0.0

In [17]:
df1.fillna(value={0:'a',2:'b',1:'c',3:'d'})

   0  1  2  3
A  1  2  3  d
B  a  5  b  6
C  6  c  b  d
D  a  c  b  d